lvx/base/AccumulationRegisters/НДСПредъявленный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НДСПредъявленный</Name>
			<Comment> НДС, предъявляемый поставщиком</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияНДСПредъявленный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентнаяОперация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорНаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СчетФактура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсправленныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйНалоговыйАгент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеализацияЭкспорт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеСчетФактураВыданный</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lvx/base/AccumulationRegisters/НДСПредъявленный/Ext/RecordSetModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Проверка ОбменДанными.Загрузка не требуется, т.к. данный объект в РИБ при записи должен создавать задания.
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Период                     КАК Период,
		|	Таблица.Организация                КАК Организация,
		|	Таблица.СчетФактура                КАК СчетФактура,
		|	Таблица.Поставщик                  КАК Поставщик,
		|	Таблица.ВидЦенности                КАК ВидЦенности,
		|	Таблица.СтавкаНДС                  КАК СтавкаНДС,
		|	Таблица.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
		|	Таблица.ИсправленныйСчетФактура    КАК ИсправленныйСчетФактура,
		|	Таблица.РеализацияЭкспорт          КАК РеализацияЭкспорт,
		|	Таблица.Событие                    КАК Событие,
		|	Таблица.КорВидДеятельностиНДС      КАК КорВидДеятельностиНДС,
		|	Таблица.ИдентификаторСтроки        КАК ИдентификаторСтроки,
		|	Таблица.РегламентнаяОперация       КАК РегламентнаяОперация,
		|	Таблица.Подразделение              КАК Подразделение,
		|	Таблица.НаправлениеДеятельности    КАК НаправлениеДеятельности,
		|	Таблица.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
		|	Таблица.СтатьяРасходов             КАК СтатьяРасходов,
		|	Таблица.АналитикаРасходов          КАК АналитикаРасходов,
		|	ВЫБОР
		|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА Таблица.СуммаБезНДС
		|		ИНАЧЕ -Таблица.СуммаБезНДС
		|	КОНЕЦ КАК СуммаБезНДСПередЗаписью,
		|	ВЫБОР
		|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА Таблица.НДС
		|		ИНАЧЕ -Таблица.НДС
		|	КОНЕЦ КАК НДСПередЗаписью,
		|	ВЫБОР
		|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА Таблица.НДСУпр
		|		ИНАЧЕ -Таблица.НДСУпр
		|	КОНЕЦ КАК НДСУпрПередЗаписью
		|ПОМЕСТИТЬ НДСПредъявленныйПередЗаписью
		|ИЗ
		|	РегистрНакопления.НДСПредъявленный КАК Таблица
		|ГДЕ
		|	Таблица.Регистратор = &Регистратор";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	// Проверка ОбменДанными.Загрузка не требуется, т.к. данный объект в РИБ при записи должен создавать задания.
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаИзменений.Период                      КАК Период,
		|	ТаблицаИзменений.Организация                 КАК Организация,
		|	ТаблицаИзменений.СчетФактура                 КАК СчетФактура,
		|	ТаблицаИзменений.Поставщик                   КАК Поставщик,
		|	ТаблицаИзменений.ВидЦенности                 КАК ВидЦенности,
		|	ТаблицаИзменений.СтавкаНДС                   КАК СтавкаНДС,
		|	ТаблицаИзменений.ВидДеятельностиНДС          КАК ВидДеятельностиНДС,
		|	ТаблицаИзменений.ИсправленныйСчетФактура     КАК ИсправленныйСчетФактура,
		|	ТаблицаИзменений.РеализацияЭкспорт           КАК РеализацияЭкспорт,
		|	ТаблицаИзменений.Событие                     КАК Событие,
		|	ТаблицаИзменений.КорВидДеятельностиНДС       КАК КорВидДеятельностиНДС,
		|	ТаблицаИзменений.ИдентификаторСтроки         КАК ИдентификаторСтроки,
		|	ТаблицаИзменений.РегламентнаяОперация        КАК РегламентнаяОперация,
		|	ТаблицаИзменений.Подразделение               КАК Подразделение,
		|	ТаблицаИзменений.НаправлениеДеятельности     КАК НаправлениеДеятельности,
		|	ТаблицаИзменений.КорНаправлениеДеятельности  КАК КорНаправлениеДеятельности,
		|	ТаблицаИзменений.СтатьяРасходов              КАК СтатьяРасходов,
		|	ТаблицаИзменений.АналитикаРасходов           КАК АналитикаРасходов,
		|	СУММА(ТаблицаИзменений.СуммаБезНДСИзменение) КАК СуммаБезНДСИзменение,
		|	СУММА(ТаблицаИзменений.НДСИзменение)         КАК НДСИзменение,
		|	СУММА(ТаблицаИзменений.НДСУпрИзменение)      КАК НДСУпрИзменение
		|ПОМЕСТИТЬ НДСПредъявленныйИзменение
		|ИЗ
		|	(ВЫБРАТЬ
		|		Таблица.Период                     КАК Период,
		|		Таблица.Организация                КАК Организация,
		|		Таблица.СчетФактура                КАК СчетФактура,
		|		Таблица.Поставщик                  КАК Поставщик,
		|		Таблица.ВидЦенности                КАК ВидЦенности,
		|		Таблица.СтавкаНДС                  КАК СтавкаНДС,
		|		Таблица.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
		|		Таблица.ИсправленныйСчетФактура    КАК ИсправленныйСчетФактура,
		|		Таблица.РеализацияЭкспорт          КАК РеализацияЭкспорт,
		|		Таблица.Событие                    КАК Событие,
		|		Таблица.КорВидДеятельностиНДС      КАК КорВидДеятельностиНДС,
		|		Таблица.ИдентификаторСтроки        КАК ИдентификаторСтроки,
		|		Таблица.РегламентнаяОперация       КАК РегламентнаяОперация,
		|		Таблица.Подразделение              КАК Подразделение,
		|		Таблица.НаправлениеДеятельности    КАК НаправлениеДеятельности,
		|		Таблица.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
		|		Таблица.СтатьяРасходов             КАК СтатьяРасходов,
		|		Таблица.АналитикаРасходов          КАК АналитикаРасходов,
		|		Таблица.СуммаБезНДСПередЗаписью    КАК СуммаБезНДСИзменение,
		|		Таблица.НДСПередЗаписью            КАК НДСИзменение,
		|		Таблица.НДСУпрПередЗаписью         КАК НДСУпрИзменение
		|	ИЗ
		|		НДСПредъявленныйПередЗаписью КАК Таблица
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Таблица.Период                     КАК Период,
		|		Таблица.Организация                КАК Организация,
		|		Таблица.СчетФактура                КАК СчетФактура,
		|		Таблица.Поставщик                  КАК Поставщик,
		|		Таблица.ВидЦенности                КАК ВидЦенности,
		|		Таблица.СтавкаНДС                  КАК СтавкаНДС,
		|		Таблица.ВидДеятельностиНДС         КАК ВидДеятельностиНДС,
		|		Таблица.ИсправленныйСчетФактура    КАК ИсправленныйСчетФактура,
		|		Таблица.РеализацияЭкспорт          КАК РеализацияЭкспорт,
		|		Таблица.Событие                    КАК Событие,
		|		Таблица.КорВидДеятельностиНДС      КАК КорВидДеятельностиНДС,
		|		Таблица.ИдентификаторСтроки        КАК ИдентификаторСтроки,
		|		Таблица.РегламентнаяОперация       КАК РегламентнаяОперация,
		|		Таблица.Подразделение              КАК Подразделение,
		|		Таблица.НаправлениеДеятельности    КАК НаправлениеДеятельности,
		|		Таблица.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
		|		Таблица.СтатьяРасходов             КАК СтатьяРасходов,
		|		Таблица.АналитикаРасходов          КАК АналитикаРасходов,
		|		ВЫБОР
		|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -Таблица.СуммаБезНДС
		|			ИНАЧЕ Таблица.СуммаБезНДС
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -Таблица.НДС
		|			ИНАЧЕ Таблица.НДС
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -Таблица.НДСУпр
		|			ИНАЧЕ Таблица.НДСУпр
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.НДСПредъявленный КАК Таблица
		|	ГДЕ
		|		Таблица.Регистратор = &Регистратор) КАК ТаблицаИзменений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаИзменений.Период,
		|	ТаблицаИзменений.Организация,
		|	ТаблицаИзменений.СчетФактура,
		|	ТаблицаИзменений.Поставщик,
		|	ТаблицаИзменений.ВидЦенности,
		|	ТаблицаИзменений.СтавкаНДС,
		|	ТаблицаИзменений.ВидДеятельностиНДС,
		|	ТаблицаИзменений.ИсправленныйСчетФактура,
		|	ТаблицаИзменений.РеализацияЭкспорт,
		|	ТаблицаИзменений.Событие,
		|	ТаблицаИзменений.КорВидДеятельностиНДС,
		|	ТаблицаИзменений.ИдентификаторСтроки,
		|	ТаблицаИзменений.РегламентнаяОперация,
		|	ТаблицаИзменений.Подразделение,
		|	ТаблицаИзменений.НаправлениеДеятельности,
		|	ТаблицаИзменений.КорНаправлениеДеятельности,
		|	ТаблицаИзменений.СтатьяРасходов,
		|	ТаблицаИзменений.АналитикаРасходов
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ТаблицаИзменений.СуммаБезНДСИзменение) <> 0 
		|		ИЛИ СУММА(ТаблицаИзменений.НДСИзменение) <> 0
		|		ИЛИ СУММА(ТаблицаИзменений.НДСУпрИзменение) <> 0) 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(ТаблицаИзменений.Период, МЕСЯЦ) КАК Месяц,
		|	ТаблицаИзменений.Организация КАК Организация,
		|	ТаблицаИзменений.СчетФактура КАК СчетФактура
		|ПОМЕСТИТЬ ИмяВТ
		|ИЗ
		|	НДСПредъявленныйИзменение КАК ТаблицаИзменений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НДСПредъявленныйПередЗаписью";
	
	ИмяВТ = Метаданные().Имя + "_ЗаданияКФормированиюДвиженийПоНДС";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяВТ", ИмяВТ);
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[1].Выбрать();
	
	ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(
		ДополнительныеСвойства,
		ИмяВТ,
		Выборка.Следующий() И Выборка.Количество > 0);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
